title: Execution from Temporary Mounted ISO/IMG
id: 5233e5a5-7542-4dcb-b9f3-87667371839c
description: Detects the mounting of an image from an archive file as seen in QakBot phishing attacks. This can be a false positive on server systems but on workstations users should rarely mount .iso or .img files.
status: experimental
author: Christian Taillon
references:
    - https://medium.com/@christiantaillon/qakbot-detection-duck-hunt-aa0cadb398a7
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - '.iso'
            - '.img'
            - '.db'
            - '.lnk'
        TargetFilename|contains:
            - '\Temp1_'
    selection2:
        TargetFilename|contains:
            - .zip
            - .RAR
            - .7z
    condition: selection and selection2
falsepositives:
    - Cases in which a user mounts an image file from a temporarily extract archive for for legitimate purposes
level: medium
